[
  {
    "id": "b3d8a1c0-5a7e-4a3b-9b2d-1a2b3c4d5e6f",
    "title": "10 Tips for Planning the Perfect Corporate Catering Event",
    "description": "Planning a corporate catering event requires attention to detail and careful consideration of your guests' needs. Start by understanding your audience - are they executives needing a quick lunch or clients expecting a gourmet experience? Always account for dietary restrictions by offering vegetarian, vegan, and gluten-free options. Presentation matters just as much as taste in professional settings, so invest in quality servingware. Consider the flow of your event - buffet stations work well for networking, while plated meals create formal atmosphere. Don't forget about beverages - a good coffee station can be just as important as the food. Always have 10% more food than you think you'll need to accommodate unexpected guests or hearty appetites.",
    "category": "Corporate Catering",
    "created_at": "2023-05-15T08:30:00Z",
    "comments_count": 12,
    "img_url": "https://images.unsplash.com/photo-1527529482837-4698179dc6ce?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "c4e9b2d1-6b8f-5b4c-0a1b-2c3d4e5f6a7b",
    "title": "Seasonal Menu Ideas for Summer Weddings",
    "description": "Summer weddings call for fresh, light, and vibrant menu options that complement the season. Start with passed hors d'oeuvres like watermelon feta skewers or chilled cucumber cups with herbed cream cheese. For main courses, consider grilled options like lemon-herb chicken or cedar-plank salmon that can be prepared outdoors. Incorporate seasonal produce like heirloom tomatoes, stone fruits, and fresh berries into your salads and desserts. A signature summer cocktail like a lavender lemonade or mango mojito can add special touch. Don't forget about food safety in warm weather - keep cold foods chilled and hot foods at proper temperatures. A well-planned summer wedding menu should reflect the lightness and joy of the season while satisfying guests' appetites.",
    "category": "Wedding Catering",
    "created_at": "2023-06-22T14:15:00Z",
    "comments_count": 8,
    "img_url": "https://images.unsplash.com/photo-1519225421980-715cb0215aed?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "d5f0c3e2-7c9g-6d5e-1b2c-3d4e5f6a7b8c",
    "title": "How to Choose the Right Caterer for Your Event",
    "description": "Selecting the perfect caterer is crucial for your event's success. Start by determining your budget and guest count before reaching out to potential caterers. Look for professionals with experience in your type of event - wedding caterers have different expertise than corporate lunch providers. Schedule tastings to evaluate food quality and presentation style. Ask about their staffing ratios to ensure proper service levels. Check references and online reviews thoroughly. Discuss their flexibility with menu customization and last-minute changes. Understand what's included in their pricing - some caterers provide linens and tableware while others don't. Pay attention to how responsive and detail-oriented they are during the planning process, as this indicates how they'll perform at your event. A good caterer should be a partner in making your vision come to life.",
    "category": "Catering Tips",
    "created_at": "2023-04-10T11:45:00Z",
    "comments_count": 15,
    "img_url": "https://images.unsplash.com/photo-1555244162-803834f70033?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "e6g1d4f3-8d0h-7e6f-2c3d-4e5f6a7b8c9d",
    "title": "The Art of Food Presentation: Elevating Your Catered Event",
    "description": "Food presentation transforms a meal from ordinary to extraordinary. Start with color - vibrant vegetables, colorful sauces, and garnishes create visual appeal. Consider height variation using cake stands or tiered trays to add dimension to your buffet. Use edible flowers or microgreens for elegant finishing touches. Plate with purpose, leaving negative space rather than overcrowding. Choose servingware that complements your event theme - rustic wood boards for casual events or fine china for formal affairs. For passed hors d'oeuvres, select unique vessels like spoons or small glasses for creative presentation. Remember that people eat with their eyes first, so take time to arrange each dish thoughtfully. Consistent plating across service staff creates a professional impression. Great presentation shows care and attention to detail that guests will notice and appreciate.",
    "category": "Catering Techniques",
    "created_at": "2023-07-05T09:20:00Z",
    "comments_count": 6,
    "img_url": "https://images.unsplash.com/photo-1544025162-d76694265947?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "f7h2e5g4-9e1i-8f7g-3d4e-5f6a7b8c9d0e",
    "title": "Sustainable Catering: Reducing Waste at Your Events",
    "description": "Eco-friendly catering practices benefit both the environment and your bottom line. Start by working with local suppliers to reduce food miles and support community businesses. Opt for seasonal ingredients that don't require energy-intensive storage or transportation. Implement careful portion planning to minimize food waste - consider using smaller plates to encourage appropriate serving sizes. Choose compostable or reusable servingware instead of single-use plastics. Donate unused food to local shelters or food banks when possible. Set up clearly labeled recycling and compost stations to help guests dispose of waste properly. Use digital menus and invitations to reduce paper waste. Train staff on conservation practices like turning off unused equipment and conserving water. Communicate your sustainability efforts to guests - many appreciate knowing they're participating in environmentally responsible events. Small changes add up to significant impact when catering large groups.",
    "category": "Sustainable Catering",
    "created_at": "2023-03-18T13:10:00Z",
    "comments_count": 9,
    "img_url": "https://images.unsplash.com/photo-1488459716781-31db52582fe9?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "a8b3f6g5-0f2j-9g8h-4e5f-6a7b8c9d0e1f",
    "title": "Cocktail Party Catering: Small Bites That Make a Big Impact",
    "description": "Cocktail parties require careful planning to create the right flow and guest experience. Plan for 8-10 pieces per person for a two-hour event, with more substantial bites if alcohol is served. Create variety with different textures and temperatures - pair crispy items with creamy dips or chilled seafood with warm breads. Include vegetarian, gluten-free, and dairy-free options to accommodate all guests. Consider interactive stations like build-your-own crostini or a gourmet slider bar. Presentation matters - use tiered stands and creative plating to elevate simple ingredients. Time your service carefully, starting with lighter fare and progressing to heartier options. Train staff to circulate efficiently without being intrusive. Signature cocktails that complement your menu can tie the event together. Remember that at cocktail parties, the food is the centerpiece, so invest in quality ingredients and creative combinations that will spark conversation.",
    "category": "Event Catering",
    "created_at": "2023-08-12T16:45:00Z",
    "comments_count": 7,
    "img_url": "https://images.unsplash.com/photo-1514362545857-3bc16c4c7d1b?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "b9c4g7h6-1g3k-0h9i-5f6a-7b8c9d0e1f2g",
    "title": "Cultural Considerations in International Event Catering",
    "description": "When catering for international events, cultural sensitivity is as important as culinary skill. Research dietary laws and restrictions - for example, halal, kosher, or Hindu vegetarian requirements. Understand that color symbolism varies globally - while white represents purity in Western cultures, it signifies mourning in some Asian cultures. Consider seating arrangements and serving styles that respect cultural norms about social hierarchy and gender dynamics. Be aware of symbolic foods that might be inappropriate for certain events. Adapt portion sizes to cultural expectations - some cultures prefer abundant displays while others value moderation. Include traditional welcoming elements like tea ceremonies or bread-breaking rituals when appropriate. Train staff on cultural etiquette to avoid unintentional offense. Most importantly, consult with cultural liaisons or community leaders when planning menus for events serving diverse international audiences. Thoughtful catering builds bridges between cultures.",
    "category": "International Catering",
    "created_at": "2023-02-28T10:30:00Z",
    "comments_count": 11,
    "img_url": "https://images.unsplash.com/photo-1547592180-85f173990554?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "c0d5h8i7-2h4l-1i0j-6a7b-8c9d0e1f2g3h",
    "title": "Brunch Catering Ideas That Will Impress Your Guests",
    "description": "Brunch catering combines breakfast and lunch elements for a versatile midday meal. Create stations for made-to-order omelets or pancakes with various toppings. Include both sweet and savory options - think Belgian waffles alongside eggs Benedict. Fresh fruit displays add color and healthy choices. For beverages, go beyond basic coffee with a mimosa bar featuring different juices or a bloody Mary station with custom garnishes. Incorporate lunch elements like carving stations or salads for guests who prefer heartier options. Presentation is key - use chalkboard signs to label dishes and tiered stands for pastries. Consider timing - brunch service should be leisurely but efficient, with food refreshed regularly. Don't forget the little touches like real maple syrup, freshly whipped cream, and high-quality coffee that elevate the experience. A well-executed brunch creates a relaxed, celebratory atmosphere perfect for showers, reunions, or corporate retreats.",
    "category": "Brunch Catering",
    "created_at": "2023-09-07T12:00:00Z",
    "comments_count": 5,
    "img_url": "https://images.unsplash.com/photo-1551218808-94e220e084d2?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "d1e6i9j8-3i5m-2j1k-7b8c-9d0e1f2g3h4i",
    "title": "How to Handle Last-Minute Changes to Your Catered Event",
    "description": "Even with perfect planning, last-minute changes are inevitable in catering. Build flexibility into your contracts and menus to accommodate unexpected adjustments. Maintain good relationships with suppliers who can provide quick substitutions when needed. Keep an emergency kit with extra linens, servingware, and common ingredients. Cross-train staff so team members can switch roles if someone calls in sick. For weather-dependent outdoor events, have both wet and dry weather plans prepared in advance. When guest counts change dramatically, work with your caterer to adjust menu quantities without sacrificing quality. Communicate changes clearly to all vendors and staff to ensure seamless execution. Most importantly, stay calm - guests will take cues from your attitude. Experienced caterers know that adaptability is as important as planning in creating successful events. With the right preparation and mindset, you can handle any last-minute challenge professionally.",
    "category": "Catering Management",
    "created_at": "2023-01-14T15:20:00Z",
    "comments_count": 4,
    "img_url": "https://images.unsplash.com/photo-1519671482749-fd09be7ccebf?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  },
  {
    "id": "e2f7j0k9-4j6n-3k2l-8c9d-0e1f2g3h4i5j",
    "title": "The Psychology of Buffet Layout: Maximizing Guest Experience",
    "description": "Buffet layout significantly impacts guest flow and food consumption patterns. Place less expensive items like salads and bread at the beginning where guests tend to fill their plates. Position your signature dishes at eye level in the middle section where they'll get attention. Create natural flow by placing plates at the start and utensils at the end. Allow enough space between stations to prevent bottlenecks. Use height variation to make the spread visually appealing without creating accessibility issues. Group logically related items together (all proteins in one area, sides in another). Consider traffic patterns - right-handed people naturally move counterclockwise. For large events, duplicate popular stations to reduce lines. Lighting is crucial - ensure food is well-lit but not under harsh lights that can dry out dishes. A well-designed buffet enhances guest experience while controlling costs through strategic placement of menu items.",
    "category": "Catering Design",
    "created_at": "2023-10-19T17:30:00Z",
    "comments_count": 10,
    "img_url": "https://images.unsplash.com/photo-1544025162-d76694265947?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
  }
]